zhengwang721/ASF/sam0/utils/cmsis/samd20/include/pio/pio_samd20j14a.h
#define MUX_PB03A_EIC_EXTINT9              0
#define PINMUX_PB03A_EIC_EXTINT9   ((PIN_PB03A_EIC_EXTINT9 << 16) | MUX_PB03A_EIC_EXTINT9)
#define PORT_PB03A_EIC_EXTINT9     (1u <<  3)
#define PIN_PB17A_EIC_EXTINT9             49  /**< \brief EIC signal: EXTINT9 on PB17 mux A */
#define MUX_PB17A_EIC_EXTINT9              0
#define PINMUX_PB17A_EIC_EXTINT9   ((PIN_PB17A_EIC_EXTINT9 << 16) | MUX_PB17A_EIC_EXTINT9)
#define PORT_PB17A_EIC_EXTINT9     (1u << 17)
#define PIN_PA06A_EIC_EXTINT10             6  /**< \brief EIC signal: EXTINT10 on PA06 mux A */
#define MUX_PA06A_EIC_EXTINT10             0
#define PINMUX_PA06A_EIC_EXTINT10  ((PIN_PA06A_EIC_EXTINT10 << 16) | MUX_PA06A_EIC_EXTINT10)
#define PORT_PA06A_EIC_EXTINT10    (1u <<  6)
#define PIN_PA18A_EIC_EXTINT10            18  /**< \brief EIC signal: EXTINT10 on PA18 mux A */
#define MUX_PA18A_EIC_EXTINT10             0
#define PINMUX_PA18A_EIC_EXTINT10  ((PIN_PA18A_EIC_EXTINT10 << 16) | MUX_PA18A_EIC_EXTINT10)
#define PORT_PA18A_EIC_EXTINT10    (1u << 18)
#define PIN_PB06A_EIC_EXTINT10            38  /**< \brief EIC signal: EXTINT10 on PB06 mux A */
#define MUX_PB06A_EIC_EXTINT10             0
#define PINMUX_PB06A_EIC_EXTINT10  ((PIN_PB06A_EIC_EXTINT10 << 16) | MUX_PB06A_EIC_EXTINT10)
#define PORT_PB06A_EIC_EXTINT10    (1u <<  6)
#define PIN_PB18A_EIC_EXTINT10            50  /**< \brief EIC signal: EXTINT10 on PB18 mux A */
#define MUX_PB18A_EIC_EXTINT10             0
#define PINMUX_PB18A_EIC_EXTINT10  ((PIN_PB18A_EIC_EXTINT10 << 16) | MUX_PB18A_EIC_EXTINT10)
#define PORT_PB18A_EIC_EXTINT10    (1u << 18)
#define PIN_PA07A_EIC_EXTINT11             7  /**< \brief EIC signal: EXTINT11 on PA07 mux A */
#define MUX_PA07A_EIC_EXTINT11             0
#define PINMUX_PA07A_EIC_EXTINT11  ((PIN_PA07A_EIC_EXTINT11 << 16) | MUX_PA07A_EIC_EXTINT11)
#define PORT_PA07A_EIC_EXTINT11    (1u <<  7)
#define PIN_PA19A_EIC_EXTINT11            19  /**< \brief EIC signal: EXTINT11 on PA19 mux A */
#define MUX_PA19A_EIC_EXTINT11             0
#define PINMUX_PA19A_EIC_EXTINT11  ((PIN_PA19A_EIC_EXTINT11 << 16) | MUX_PA19A_EIC_EXTINT11)
#define PORT_PA19A_EIC_EXTINT11    (1u << 19)
#define PIN_PB07A_EIC_EXTINT11            39  /**< \brief EIC signal: EXTINT11 on PB07 mux A */
#define MUX_PB07A_EIC_EXTINT11             0
#define PINMUX_PB07A_EIC_EXTINT11  ((PIN_PB07A_EIC_EXTINT11 << 16) | MUX_PB07A_EIC_EXTINT11)
#define PORT_PB07A_EIC_EXTINT11    (1u <<  7)
#define PIN_PB19A_EIC_EXTINT11            51  /**< \brief EIC signal: EXTINT11 on PB19 mux A */
#define MUX_PB19A_EIC_EXTINT11             0
#define PINMUX_PB19A_EIC_EXTINT11  ((PIN_PB19A_EIC_EXTINT11 << 16) | MUX_PB19A_EIC_EXTINT11)
#define PORT_PB19A_EIC_EXTINT11    (1u << 19)
#define PIN_PA12A_EIC_EXTINT12            12  /**< \brief EIC signal: EXTINT12 on PA12 mux A */
#define MUX_PA12A_EIC_EXTINT12             0
#define PINMUX_PA12A_EIC_EXTINT12  ((PIN_PA12A_EIC_EXTINT12 << 16) | MUX_PA12A_EIC_EXTINT12)
#define PORT_PA12A_EIC_EXTINT12    (1u << 12)
#define PIN_PA24A_EIC_EXTINT12            24  /**< \brief EIC signal: EXTINT12 on PA24 mux A */
#define MUX_PA24A_EIC_EXTINT12             0
#define PINMUX_PA24A_EIC_EXTINT12  ((PIN_PA24A_EIC_EXTINT12 << 16) | MUX_PA24A_EIC_EXTINT12)
#define PORT_PA24A_EIC_EXTINT12    (1u << 24)
#define PIN_PB12A_EIC_EXTINT12            44  /**< \brief EIC signal: EXTINT12 on PB12 mux A */
#define MUX_PB12A_EIC_EXTINT12             0
#define PINMUX_PB12A_EIC_EXTINT12  ((PIN_PB12A_EIC_EXTINT12 << 16) | MUX_PB12A_EIC_EXTINT12)
#define PORT_PB12A_EIC_EXTINT12    (1u << 12)
#define PIN_PB24A_EIC_EXTINT12            56  /**< \brief EIC signal: EXTINT12 on PB24 mux A */
#define MUX_PB24A_EIC_EXTINT12             0
#define PINMUX_PB24A_EIC_EXTINT12  ((PIN_PB24A_EIC_EXTINT12 << 16) | MUX_PB24A_EIC_EXTINT12)
#define PORT_PB24A_EIC_EXTINT12    (1u << 24)
#define PIN_PA13A_EIC_EXTINT13            13  /**< \brief EIC signal: EXTINT13 on PA13 mux A */
#define MUX_PA13A_EIC_EXTINT13             0
#define PINMUX_PA13A_EIC_EXTINT13  ((PIN_PA13A_EIC_EXTINT13 << 16) | MUX_PA13A_EIC_EXTINT13)
#define PORT_PA13A_EIC_EXTINT13    (1u << 13)
#define PIN_PA25A_EIC_EXTINT13            25  /**< \brief EIC signal: EXTINT13 on PA25 mux A */
#define MUX_PA25A_EIC_EXTINT13             0
#define PINMUX_PA25A_EIC_EXTINT13  ((PIN_PA25A_EIC_EXTINT13 << 16) | MUX_PA25A_EIC_EXTINT13)
#define PORT_PA25A_EIC_EXTINT13    (1u << 25)
#define PIN_PB13A_EIC_EXTINT13            45  /**< \brief EIC signal: EXTINT13 on PB13 mux A */
#define MUX_PB13A_EIC_EXTINT13             0
#define PINMUX_PB13A_EIC_EXTINT13  ((PIN_PB13A_EIC_EXTINT13 << 16) | MUX_PB13A_EIC_EXTINT13)
#define PORT_PB13A_EIC_EXTINT13    (1u << 13)
#define PIN_PB25A_EIC_EXTINT13            57  /**< \brief EIC signal: EXTINT13 on PB25 mux A */
#define MUX_PB25A_EIC_EXTINT13             0
#define PINMUX_PB25A_EIC_EXTINT13  ((PIN_PB25A_EIC_EXTINT13 << 16) | MUX_PB25A_EIC_EXTINT13)
#define PORT_PB25A_EIC_EXTINT13    (1u << 25)
#define PIN_PA14A_EIC_EXTINT14            14  /**< \brief EIC signal: EXTINT14 on PA14 mux A */
#define MUX_PA14A_EIC_EXTINT14             0
#define PINMUX_PA14A_EIC_EXTINT14  ((PIN_PA14A_EIC_EXTINT14 << 16) | MUX_PA14A_EIC_EXTINT14)
#define PORT_PA14A_EIC_EXTINT14    (1u << 14)
#define PIN_PA26A_EIC_EXTINT14            26  /**< \brief EIC signal: EXTINT14 on PA26 mux A */
#define MUX_PA26A_EIC_EXTINT14             0
#define PINMUX_PA26A_EIC_EXTINT14  ((PIN_PA26A_EIC_EXTINT14 << 16) | MUX_PA26A_EIC_EXTINT14)
#define PORT_PA26A_EIC_EXTINT14    (1u << 26)
#define PIN_PB26A_EIC_EXTINT14            58  /**< \brief EIC signal: EXTINT14 on PB26 mux A */
#define MUX_PB26A_EIC_EXTINT14             0
#define PINMUX_PB26A_EIC_EXTINT14  ((PIN_PB26A_EIC_EXTINT14 << 16) | MUX_PB26A_EIC_EXTINT14)
#define PORT_PB26A_EIC_EXTINT14    (1u << 26)
#define PIN_PA15A_EIC_EXTINT15            15  /**< \brief EIC signal: EXTINT15 on PA15 mux A */
#define MUX_PA15A_EIC_EXTINT15             0
#define PINMUX_PA15A_EIC_EXTINT15  ((PIN_PA15A_EIC_EXTINT15 << 16) | MUX_PA15A_EIC_EXTINT15)
#define PORT_PA15A_EIC_EXTINT15    (1u << 15)
#define PIN_PA27A_EIC_EXTINT15            27  /**< \brief EIC signal: EXTINT15 on PA27 mux A */
#define MUX_PA27A_EIC_EXTINT15             0
#define PINMUX_PA27A_EIC_EXTINT15  ((PIN_PA27A_EIC_EXTINT15 << 16) | MUX_PA27A_EIC_EXTINT15)
#define PORT_PA27A_EIC_EXTINT15    (1u << 27)
#define PIN_PB27A_EIC_EXTINT15            59  /**< \brief EIC signal: EXTINT15 on PB27 mux A */
#define MUX_PB27A_EIC_EXTINT15             0
#define PINMUX_PB27A_EIC_EXTINT15  ((PIN_PB27A_EIC_EXTINT15 << 16) | MUX_PB27A_EIC_EXTINT15)
#define PORT_PB27A_EIC_EXTINT15    (1u << 27)
#define PIN_PA30A_EIC_NMI                 30  /**< \brief EIC signal: NMI on PA30 mux A */
#define MUX_PA30A_EIC_NMI                  0
#define PINMUX_PA30A_EIC_NMI       ((PIN_PA30A_EIC_NMI << 16) | MUX_PA30A_EIC_NMI)
#define PORT_PA30A_EIC_NMI         (1u << 30)
/* ========== PORT definition for SERCOM0 peripheral ========== */
#define PIN_PA02C_SERCOM0_PAD0             2  /**< \brief SERCOM0 signal: PAD0 on PA02 mux C */
#define MUX_PA02C_SERCOM0_PAD0             2
#define PINMUX_PA02C_SERCOM0_PAD0  ((PIN_PA02C_SERCOM0_PAD0 << 16) | MUX_PA02C_SERCOM0_PAD0)
#define PORT_PA02C_SERCOM0_PAD0    (1u <<  2)
#define PIN_PA10B_SERCOM0_PAD0            10  /**< \brief SERCOM0 signal: PAD0 on PA10 mux B */
#define MUX_PA10B_SERCOM0_PAD0             1
#define PINMUX_PA10B_SERCOM0_PAD0  ((PIN_PA10B_SERCOM0_PAD0 << 16) | MUX_PA10B_SERCOM0_PAD0)
#define PORT_PA10B_SERCOM0_PAD0    (1u << 10)
#define PIN_PA03C_SERCOM0_PAD1             3  /**< \brief SERCOM0 signal: PAD1 on PA03 mux C */
#define MUX_PA03C_SERCOM0_PAD1             2
#define PINMUX_PA03C_SERCOM0_PAD1  ((PIN_PA03C_SERCOM0_PAD1 << 16) | MUX_PA03C_SERCOM0_PAD1)
#define PORT_PA03C_SERCOM0_PAD1    (1u <<  3)
#define PIN_PA11B_SERCOM0_PAD1            11  /**< \brief SERCOM0 signal: PAD1 on PA11 mux B */
#define MUX_PA11B_SERCOM0_PAD1             1
#define PINMUX_PA11B_SERCOM0_PAD1  ((PIN_PA11B_SERCOM0_PAD1 << 16) | MUX_PA11B_SERCOM0_PAD1)
#define PORT_PA11B_SERCOM0_PAD1    (1u << 11)
#define PIN_PA00C_SERCOM0_PAD2             0  /**< \brief SERCOM0 signal: PAD2 on PA00 mux C */
#define MUX_PA00C_SERCOM0_PAD2             2
#define PINMUX_PA00C_SERCOM0_PAD2  ((PIN_PA00C_SERCOM0_PAD2 << 16) | MUX_PA00C_SERCOM0_PAD2)
#define PORT_PA00C_SERCOM0_PAD2    (1u <<  0)
#define PIN_PA08B_SERCOM0_PAD2             8  /**< \brief SERCOM0 signal: PAD2 on PA08 mux B */
#define MUX_PA08B_SERCOM0_PAD2             1
#define PINMUX_PA08B_SERCOM0_PAD2  ((PIN_PA08B_SERCOM0_PAD2 << 16) | MUX_PA08B_SERCOM0_PAD2)
#define PORT_PA08B_SERCOM0_PAD2    (1u <<  8)
#define PIN_PA01C_SERCOM0_PAD3             1  /**< \brief SERCOM0 signal: PAD3 on PA01 mux C */
#define MUX_PA01C_SERCOM0_PAD3             2
#define PINMUX_PA01C_SERCOM0_PAD3  ((PIN_PA01C_SERCOM0_PAD3 << 16) | MUX_PA01C_SERCOM0_PAD3)
#define PORT_PA01C_SERCOM0_PAD3    (1u <<  1)
#define PIN_PA09B_SERCOM0_PAD3             9  /**< \brief SERCOM0 signal: PAD3 on PA09 mux B */
#define MUX_PA09B_SERCOM0_PAD3             1
#define PINMUX_PA09B_SERCOM0_PAD3  ((PIN_PA09B_SERCOM0_PAD3 << 16) | MUX_PA09B_SERCOM0_PAD3)
#define PORT_PA09B_SERCOM0_PAD3    (1u <<  9)
/* ========== PORT definition for SERCOM1 peripheral ========== */
#define PIN_PA30C_SERCOM1_PAD0            30  /**< \brief SERCOM1 signal: PAD0 on PA30 mux C */
#define MUX_PA30C_SERCOM1_PAD0             2
#define PINMUX_PA30C_SERCOM1_PAD0  ((PIN_PA30C_SERCOM1_PAD0 << 16) | MUX_PA30C_SERCOM1_PAD0)
#define PORT_PA30C_SERCOM1_PAD0    (1u << 30)
#define PIN_PA18B_SERCOM1_PAD0            18  /**< \brief SERCOM1 signal: PAD0 on PA18 mux B */
#define MUX_PA18B_SERCOM1_PAD0             1
#define PINMUX_PA18B_SERCOM1_PAD0  ((PIN_PA18B_SERCOM1_PAD0 << 16) | MUX_PA18B_SERCOM1_PAD0)
#define PORT_PA18B_SERCOM1_PAD0    (1u << 18)
#define PIN_PA31C_SERCOM1_PAD1            31  /**< \brief SERCOM1 signal: PAD1 on PA31 mux C */
#define MUX_PA31C_SERCOM1_PAD1             2
#define PINMUX_PA31C_SERCOM1_PAD1  ((PIN_PA31C_SERCOM1_PAD1 << 16) | MUX_PA31C_SERCOM1_PAD1)
#define PORT_PA31C_SERCOM1_PAD1    (1u << 31)
#define PIN_PA19B_SERCOM1_PAD1            19  /**< \brief SERCOM1 signal: PAD1 on PA19 mux B */
#define MUX_PA19B_SERCOM1_PAD1             1
#define PINMUX_PA19B_SERCOM1_PAD1  ((PIN_PA19B_SERCOM1_PAD1 << 16) | MUX_PA19B_SERCOM1_PAD1)
#define PORT_PA19B_SERCOM1_PAD1    (1u << 19)
#define PIN_PA04C_SERCOM1_PAD2             4  /**< \brief SERCOM1 signal: PAD2 on PA04 mux C */
#define MUX_PA04C_SERCOM1_PAD2             2
#define PINMUX_PA04C_SERCOM1_PAD2  ((PIN_PA04C_SERCOM1_PAD2 << 16) | MUX_PA04C_SERCOM1_PAD2)
#define PORT_PA04C_SERCOM1_PAD2    (1u <<  4)
#define PIN_PA16B_SERCOM1_PAD2            16  /**< \brief SERCOM1 signal: PAD2 on PA16 mux B */
#define MUX_PA16B_SERCOM1_PAD2             1
#define PINMUX_PA16B_SERCOM1_PAD2  ((PIN_PA16B_SERCOM1_PAD2 << 16) | MUX_PA16B_SERCOM1_PAD2)
#define PORT_PA16B_SERCOM1_PAD2    (1u << 16)
#define PIN_PA05C_SERCOM1_PAD3             5  /**< \brief SERCOM1 signal: PAD3 on PA05 mux C */
#define MUX_PA05C_SERCOM1_PAD3             2
#define PINMUX_PA05C_SERCOM1_PAD3  ((PIN_PA05C_SERCOM1_PAD3 << 16) | MUX_PA05C_SERCOM1_PAD3)
#define PORT_PA05C_SERCOM1_PAD3    (1u <<  5)
#define PIN_PA17B_SERCOM1_PAD3            17  /**< \brief SERCOM1 signal: PAD3 on PA17 mux B */
#define MUX_PA17B_SERCOM1_PAD3             1
#define PINMUX_PA17B_SERCOM1_PAD3  ((PIN_PA17B_SERCOM1_PAD3 << 16) | MUX_PA17B_SERCOM1_PAD3)
#define PORT_PA17B_SERCOM1_PAD3    (1u << 17)
/* ========== PORT definition for SERCOM2 peripheral ========== */
#define PIN_PA10C_SERCOM2_PAD0            10  /**< \brief SERCOM2 signal: PAD0 on PA10 mux C */
#define MUX_PA10C_SERCOM2_PAD0             2
#define PINMUX_PA10C_SERCOM2_PAD0  ((PIN_PA10C_SERCOM2_PAD0 << 16) | MUX_PA10C_SERCOM2_PAD0)
#define PORT_PA10C_SERCOM2_PAD0    (1u << 10)
#define PIN_PA14B_SERCOM2_PAD0            14  /**< \brief SERCOM2 signal: PAD0 on PA14 mux B */
#define MUX_PA14B_SERCOM2_PAD0             1
#define PINMUX_PA14B_SERCOM2_PAD0  ((PIN_PA14B_SERCOM2_PAD0 << 16) | MUX_PA14B_SERCOM2_PAD0)
#define PORT_PA14B_SERCOM2_PAD0    (1u << 14)
#define PIN_PA11C_SERCOM2_PAD1            11  /**< \brief SERCOM2 signal: PAD1 on PA11 mux C */
#define MUX_PA11C_SERCOM2_PAD1             2
#define PINMUX_PA11C_SERCOM2_PAD1  ((PIN_PA11C_SERCOM2_PAD1 << 16) | MUX_PA11C_SERCOM2_PAD1)
#define PORT_PA11C_SERCOM2_PAD1    (1u << 11)
#define PIN_PA15B_SERCOM2_PAD1            15  /**< \brief SERCOM2 signal: PAD1 on PA15 mux B */
#define MUX_PA15B_SERCOM2_PAD1             1
#define PINMUX_PA15B_SERCOM2_PAD1  ((PIN_PA15B_SERCOM2_PAD1 << 16) | MUX_PA15B_SERCOM2_PAD1)
#define PORT_PA15B_SERCOM2_PAD1    (1u << 15)
#define PIN_PA08C_SERCOM2_PAD2             8  /**< \brief SERCOM2 signal: PAD2 on PA08 mux C */
#define MUX_PA08C_SERCOM2_PAD2             2
#define PINMUX_PA08C_SERCOM2_PAD2  ((PIN_PA08C_SERCOM2_PAD2 << 16) | MUX_PA08C_SERCOM2_PAD2)
#define PORT_PA08C_SERCOM2_PAD2    (1u <<  8)
#define PIN_PA12B_SERCOM2_PAD2            12  /**< \brief SERCOM2 signal: PAD2 on PA12 mux B */
#define MUX_PA12B_SERCOM2_PAD2             1
#define PINMUX_PA12B_SERCOM2_PAD2  ((PIN_PA12B_SERCOM2_PAD2 << 16) | MUX_PA12B_SERCOM2_PAD2)
#define PORT_PA12B_SERCOM2_PAD2    (1u << 12)
#define PIN_PA09C_SERCOM2_PAD3             9  /**< \brief SERCOM2 signal: PAD3 on PA09 mux C */
#define MUX_PA09C_SERCOM2_PAD3             2
#define PINMUX_PA09C_SERCOM2_PAD3  ((PIN_PA09C_SERCOM2_PAD3 << 16) | MUX_PA09C_SERCOM2_PAD3)
#define PORT_PA09C_SERCOM2_PAD3    (1u <<  9)
#define PIN_PA13B_SERCOM2_PAD3            13  /**< \brief SERCOM2 signal: PAD3 on PA13 mux B */
#define MUX_PA13B_SERCOM2_PAD3             1
#define PINMUX_PA13B_SERCOM2_PAD3  ((PIN_PA13B_SERCOM2_PAD3 << 16) | MUX_PA13B_SERCOM2_PAD3)
#define PORT_PA13B_SERCOM2_PAD3    (1u << 13)
/* ========== PORT definition for SERCOM3 peripheral ========== */
#define PIN_PA18C_SERCOM3_PAD0            18  /**< \brief SERCOM3 signal: PAD0 on PA18 mux C */
#define MUX_PA18C_SERCOM3_PAD0             2
#define PINMUX_PA18C_SERCOM3_PAD0  ((PIN_PA18C_SERCOM3_PAD0 << 16) | MUX_PA18C_SERCOM3_PAD0)
#define PORT_PA18C_SERCOM3_PAD0    (1u << 18)
#define PIN_PA24B_SERCOM3_PAD0            24  /**< \brief SERCOM3 signal: PAD0 on PA24 mux B */
#define MUX_PA24B_SERCOM3_PAD0             1
#define PINMUX_PA24B_SERCOM3_PAD0  ((PIN_PA24B_SERCOM3_PAD0 << 16) | MUX_PA24B_SERCOM3_PAD0)
#define PORT_PA24B_SERCOM3_PAD0    (1u << 24)
#define PIN_PA19C_SERCOM3_PAD1            19  /**< \brief SERCOM3 signal: PAD1 on PA19 mux C */
#define MUX_PA19C_SERCOM3_PAD1             2
#define PINMUX_PA19C_SERCOM3_PAD1  ((PIN_PA19C_SERCOM3_PAD1 << 16) | MUX_PA19C_SERCOM3_PAD1)
#define PORT_PA19C_SERCOM3_PAD1    (1u << 19)
#define PIN_PA25B_SERCOM3_PAD1            25  /**< \brief SERCOM3 signal: PAD1 on PA25 mux B */
#define MUX_PA25B_SERCOM3_PAD1             1
#define PINMUX_PA25B_SERCOM3_PAD1  ((PIN_PA25B_SERCOM3_PAD1 << 16) | MUX_PA25B_SERCOM3_PAD1)
#define PORT_PA25B_SERCOM3_PAD1    (1u << 25)
#define PIN_PA16C_SERCOM3_PAD2            16  /**< \brief SERCOM3 signal: PAD2 on PA16 mux C */
#define MUX_PA16C_SERCOM3_PAD2             2
#define PINMUX_PA16C_SERCOM3_PAD2  ((PIN_PA16C_SERCOM3_PAD2 << 16) | MUX_PA16C_SERCOM3_PAD2)
#define PORT_PA16C_SERCOM3_PAD2    (1u << 16)
#define PIN_PA26B_SERCOM3_PAD2            26  /**< \brief SERCOM3 signal: PAD2 on PA26 mux B */
#define MUX_PA26B_SERCOM3_PAD2             1
#define PINMUX_PA26B_SERCOM3_PAD2  ((PIN_PA26B_SERCOM3_PAD2 << 16) | MUX_PA26B_SERCOM3_PAD2)
#define PORT_PA26B_SERCOM3_PAD2    (1u << 26)
#define PIN_PA17C_SERCOM3_PAD3            17  /**< \brief SERCOM3 signal: PAD3 on PA17 mux C */
#define MUX_PA17C_SERCOM3_PAD3             2
#define PINMUX_PA17C_SERCOM3_PAD3  ((PIN_PA17C_SERCOM3_PAD3 << 16) | MUX_PA17C_SERCOM3_PAD3)
#define PORT_PA17C_SERCOM3_PAD3    (1u << 17)
#define PIN_PA27B_SERCOM3_PAD3            27  /**< \brief SERCOM3 signal: PAD3 on PA27 mux B */
#define MUX_PA27B_SERCOM3_PAD3             1
#define PINMUX_PA27B_SERCOM3_PAD3  ((PIN_PA27B_SERCOM3_PAD3 << 16) | MUX_PA27B_SERCOM3_PAD3)
#define PORT_PA27B_SERCOM3_PAD3    (1u << 27)
/* ========== PORT definition for SERCOM4 peripheral ========== */
#define PIN_PA14C_SERCOM4_PAD0            14  /**< \brief SERCOM4 signal: PAD0 on PA14 mux C */
#define MUX_PA14C_SERCOM4_PAD0             2
#define PINMUX_PA14C_SERCOM4_PAD0  ((PIN_PA14C_SERCOM4_PAD0 << 16) | MUX_PA14C_SERCOM4_PAD0)
#define PORT_PA14C_SERCOM4_PAD0    (1u << 14)
#define PIN_PB00C_SERCOM4_PAD0            32  /**< \brief SERCOM4 signal: PAD0 on PB00 mux C */
#define MUX_PB00C_SERCOM4_PAD0             2
#define PINMUX_PB00C_SERCOM4_PAD0  ((PIN_PB00C_SERCOM4_PAD0 << 16) | MUX_PB00C_SERCOM4_PAD0)
#define PORT_PB00C_SERCOM4_PAD0    (1u <<  0)
#define PIN_PB08B_SERCOM4_PAD0            40  /**< \brief SERCOM4 signal: PAD0 on PB08 mux B */
#define MUX_PB08B_SERCOM4_PAD0             1
#define PINMUX_PB08B_SERCOM4_PAD0  ((PIN_PB08B_SERCOM4_PAD0 << 16) | MUX_PB08B_SERCOM4_PAD0)
#define PORT_PB08B_SERCOM4_PAD0    (1u <<  8)
#define PIN_PA15C_SERCOM4_PAD1            15  /**< \brief SERCOM4 signal: PAD1 on PA15 mux C */
#define MUX_PA15C_SERCOM4_PAD1             2
#define PINMUX_PA15C_SERCOM4_PAD1  ((PIN_PA15C_SERCOM4_PAD1 << 16) | MUX_PA15C_SERCOM4_PAD1)
#define PORT_PA15C_SERCOM4_PAD1    (1u << 15)
#define PIN_PB01C_SERCOM4_PAD1            33  /**< \brief SERCOM4 signal: PAD1 on PB01 mux C */
#define MUX_PB01C_SERCOM4_PAD1             2
#define PINMUX_PB01C_SERCOM4_PAD1  ((PIN_PB01C_SERCOM4_PAD1 << 16) | MUX_PB01C_SERCOM4_PAD1)
#define PORT_PB01C_SERCOM4_PAD1    (1u <<  1)
#define PIN_PB09B_SERCOM4_PAD1            41  /**< \brief SERCOM4 signal: PAD1 on PB09 mux B */
#define MUX_PB09B_SERCOM4_PAD1             1
#define PINMUX_PB09B_SERCOM4_PAD1  ((PIN_PB09B_SERCOM4_PAD1 << 16) | MUX_PB09B_SERCOM4_PAD1)
#define PORT_PB09B_SERCOM4_PAD1    (1u <<  9)
#define PIN_PB02C_SERCOM4_PAD2            34  /**< \brief SERCOM4 signal: PAD2 on PB02 mux C */
#define MUX_PB02C_SERCOM4_PAD2             2
#define PINMUX_PB02C_SERCOM4_PAD2  ((PIN_PB02C_SERCOM4_PAD2 << 16) | MUX_PB02C_SERCOM4_PAD2)
#define PORT_PB02C_SERCOM4_PAD2    (1u <<  2)
#define PIN_PB10B_SERCOM4_PAD2            42  /**< \brief SERCOM4 signal: PAD2 on PB10 mux B */
#define MUX_PB10B_SERCOM4_PAD2             1
#define PINMUX_PB10B_SERCOM4_PAD2  ((PIN_PB10B_SERCOM4_PAD2 << 16) | MUX_PB10B_SERCOM4_PAD2)
#define PORT_PB10B_SERCOM4_PAD2    (1u << 10)
#define PIN_PA12C_SERCOM4_PAD2            12  /**< \brief SERCOM4 signal: PAD2 on PA12 mux C */
#define MUX_PA12C_SERCOM4_PAD2             2
#define PINMUX_PA12C_SERCOM4_PAD2  ((PIN_PA12C_SERCOM4_PAD2 << 16) | MUX_PA12C_SERCOM4_PAD2)
#define PORT_PA12C_SERCOM4_PAD2    (1u << 12)
#define PIN_PA13C_SERCOM4_PAD3            13  /**< \brief SERCOM4 signal: PAD3 on PA13 mux C */
#define MUX_PA13C_SERCOM4_PAD3             2
#define PINMUX_PA13C_SERCOM4_PAD3  ((PIN_PA13C_SERCOM4_PAD3 << 16) | MUX_PA13C_SERCOM4_PAD3)
#define PORT_PA13C_SERCOM4_PAD3    (1u << 13)
#define PIN_PB03C_SERCOM4_PAD3            35  /**< \brief SERCOM4 signal: PAD3 on PB03 mux C */
#define MUX_PB03C_SERCOM4_PAD3             2
#define PINMUX_PB03C_SERCOM4_PAD3  ((PIN_PB03C_SERCOM4_PAD3 << 16) | MUX_PB03C_SERCOM4_PAD3)
#define PORT_PB03C_SERCOM4_PAD3    (1u <<  3)
#define PIN_PB11B_SERCOM4_PAD3            43  /**< \brief SERCOM4 signal: PAD3 on PB11 mux B */
#define MUX_PB11B_SERCOM4_PAD3             1
#define PINMUX_PB11B_SERCOM4_PAD3  ((PIN_PB11B_SERCOM4_PAD3 << 16) | MUX_PB11B_SERCOM4_PAD3)
#define PORT_PB11B_SERCOM4_PAD3    (1u << 11)
/* ========== PORT definition for SERCOM5 peripheral ========== */
#define PIN_PA24C_SERCOM5_PAD0            24  /**< \brief SERCOM5 signal: PAD0 on PA24 mux C */
#define MUX_PA24C_SERCOM5_PAD0             2
#define PINMUX_PA24C_SERCOM5_PAD0  ((PIN_PA24C_SERCOM5_PAD0 << 16) | MUX_PA24C_SERCOM5_PAD0)
#define PORT_PA24C_SERCOM5_PAD0    (1u << 24)
#define PIN_PB16C_SERCOM5_PAD0            48  /**< \brief SERCOM5 signal: PAD0 on PB16 mux C */
#define MUX_PB16C_SERCOM5_PAD0             2
#define PINMUX_PB16C_SERCOM5_PAD0  ((PIN_PB16C_SERCOM5_PAD0 << 16) | MUX_PB16C_SERCOM5_PAD0)
#define PORT_PB16C_SERCOM5_PAD0    (1u << 16)
#define PIN_PB20B_SERCOM5_PAD0            52  /**< \brief SERCOM5 signal: PAD0 on PB20 mux B */
#define MUX_PB20B_SERCOM5_PAD0             1
#define PINMUX_PB20B_SERCOM5_PAD0  ((PIN_PB20B_SERCOM5_PAD0 << 16) | MUX_PB20B_SERCOM5_PAD0)
#define PORT_PB20B_SERCOM5_PAD0    (1u << 20)
#define PIN_PA25C_SERCOM5_PAD1            25  /**< \brief SERCOM5 signal: PAD1 on PA25 mux C */
#define MUX_PA25C_SERCOM5_PAD1             2
#define PINMUX_PA25C_SERCOM5_PAD1  ((PIN_PA25C_SERCOM5_PAD1 << 16) | MUX_PA25C_SERCOM5_PAD1)
#define PORT_PA25C_SERCOM5_PAD1    (1u << 25)
#define PIN_PB17C_SERCOM5_PAD1            49  /**< \brief SERCOM5 signal: PAD1 on PB17 mux C */
#define MUX_PB17C_SERCOM5_PAD1             2
#define PINMUX_PB17C_SERCOM5_PAD1  ((PIN_PB17C_SERCOM5_PAD1 << 16) | MUX_PB17C_SERCOM5_PAD1)
#define PORT_PB17C_SERCOM5_PAD1    (1u << 17)
#define PIN_PB21B_SERCOM5_PAD1            53  /**< \brief SERCOM5 signal: PAD1 on PB21 mux B */
#define MUX_PB21B_SERCOM5_PAD1             1
#define PINMUX_PB21B_SERCOM5_PAD1  ((PIN_PB21B_SERCOM5_PAD1 << 16) | MUX_PB21B_SERCOM5_PAD1)
#define PORT_PB21B_SERCOM5_PAD1    (1u << 21)
#define PIN_PA26C_SERCOM5_PAD2            26  /**< \brief SERCOM5 signal: PAD2 on PA26 mux C */
#define MUX_PA26C_SERCOM5_PAD2             2
#define PINMUX_PA26C_SERCOM5_PAD2  ((PIN_PA26C_SERCOM5_PAD2 << 16) | MUX_PA26C_SERCOM5_PAD2)
#define PORT_PA26C_SERCOM5_PAD2    (1u << 26)
#define PIN_PB18C_SERCOM5_PAD2            50  /**< \brief SERCOM5 signal: PAD2 on PB18 mux C */
#define MUX_PB18C_SERCOM5_PAD2             2
#define PINMUX_PB18C_SERCOM5_PAD2  ((PIN_PB18C_SERCOM5_PAD2 << 16) | MUX_PB18C_SERCOM5_PAD2)
#define PORT_PB18C_SERCOM5_PAD2    (1u << 18)
#define PIN_PB22B_SERCOM5_PAD2            54  /**< \brief SERCOM5 signal: PAD2 on PB22 mux B */
#define MUX_PB22B_SERCOM5_PAD2             1
#define PINMUX_PB22B_SERCOM5_PAD2  ((PIN_PB22B_SERCOM5_PAD2 << 16) | MUX_PB22B_SERCOM5_PAD2)
#define PORT_PB22B_SERCOM5_PAD2    (1u << 22)
#define PIN_PA27C_SERCOM5_PAD3            27  /**< \brief SERCOM5 signal: PAD3 on PA27 mux C */
#define MUX_PA27C_SERCOM5_PAD3             2
#define PINMUX_PA27C_SERCOM5_PAD3  ((PIN_PA27C_SERCOM5_PAD3 << 16) | MUX_PA27C_SERCOM5_PAD3)
#define PORT_PA27C_SERCOM5_PAD3    (1u << 27)
#define PIN_PB19C_SERCOM5_PAD3            51  /**< \brief SERCOM5 signal: PAD3 on PB19 mux C */
#define MUX_PB19C_SERCOM5_PAD3             2
#define PINMUX_PB19C_SERCOM5_PAD3  ((PIN_PB19C_SERCOM5_PAD3 << 16) | MUX_PB19C_SERCOM5_PAD3)
#define PORT_PB19C_SERCOM5_PAD3    (1u << 19)
#define PIN_PB23B_SERCOM5_PAD3            55  /**< \brief SERCOM5 signal: PAD3 on PB23 mux B */
#define MUX_PB23B_SERCOM5_PAD3             1
#define PINMUX_PB23B_SERCOM5_PAD3  ((PIN_PB23B_SERCOM5_PAD3 << 16) | MUX_PB23B_SERCOM5_PAD3)
#define PORT_PB23B_SERCOM5_PAD3    (1u << 23)
/* ========== PORT definition for TC0 peripheral ========== */
#define PIN_PA00D_TC0_WO0                  0  /**< \brief TC0 signal: WO0 on PA00 mux D */
#define MUX_PA00D_TC0_WO0                  3
#define PINMUX_PA00D_TC0_WO0       ((PIN_PA00D_TC0_WO0 << 16) | MUX_PA00D_TC0_WO0)
#define PORT_PA00D_TC0_WO0         (1u <<  0)
#define PIN_PA08D_TC0_WO0                  8  /**< \brief TC0 signal: WO0 on PA08 mux D */
#define MUX_PA08D_TC0_WO0                  3
#define PINMUX_PA08D_TC0_WO0       ((PIN_PA08D_TC0_WO0 << 16) | MUX_PA08D_TC0_WO0)
#define PORT_PA08D_TC0_WO0         (1u <<  8)
#define PIN_PA01D_TC0_WO1                  1  /**< \brief TC0 signal: WO1 on PA01 mux D */
#define MUX_PA01D_TC0_WO1                  3
#define PINMUX_PA01D_TC0_WO1       ((PIN_PA01D_TC0_WO1 << 16) | MUX_PA01D_TC0_WO1)
#define PORT_PA01D_TC0_WO1         (1u <<  1)
#define PIN_PA09D_TC0_WO1                  9  /**< \brief TC0 signal: WO1 on PA09 mux D */
#define MUX_PA09D_TC0_WO1                  3
